//* Обычные и самозакрыв.

// innetHTML textContent innerText

//! innetHTML 
// это память между открывающимся и закрывающимся тегом  (работае с тегами)
//? Обычныx



//* Atributs
// class id type value placholder title min max selected href alt src    // ** slot **

//! href 
// это путь к фалу 
// ? a link

//! class
// Классы позволяют CSS и JavaScript выбирать и получать доступ к определенным элементам
//? all teg

//! type 
// Тип элемента для отображения
//? input

//! value
// устанавливает или возвращает значение атрибута
//? input, option

//! placeholder
// указывает краткую подсказку (слово или короткую фразу) в текстовом элементе формы, предназначенную для помощи пользователю с вводом данных.
//? <input>: text, search, url, tel, email, password.

//! title
//определяет заголовок документа, который отображается в заголовке окна браузера или на вкладке страницы
//? <head>

//! min
// Устанавливает нижнее значение для ввода числа или даты в поле формы.
//? input type : number, range, date, datetime, datetime-local, month, time, week.

//! max
// Устанавливает верхнее значение для ввода числа или даты в поле формы.
//? input type : number, range, date, datetime, datetime-local, month, time, week.

//! select
//позволяет создать элемент интерфейса в виде раскрывающегося списка, а также список с одним или множественным выбором.
//?


//! href
// задаёт адрес документа, на который следует перейти. 
//? a

//! alt 
// это текстовый атрибут, который есть у HTML-тега 'img', описывающего изображение.
//? img

//! src
// указывает путь к файлу, который необходимо загрузить в окно браузера.
//? <input>, script

//! slot
//HTML-элемент <slot> является частью набора технологии Web Components, является заполнителем внутри веб компонента, который можно заполнить собственной разметкой, которая позволяет создавать отдельные деревья DOM и представлять их вместе.
//? 


//  selected disabled style

//? slot
